Задачи на урок:

Разбор домашнего задания
Класс Scanner
Класс Math и его основные методы
Методы в Java
Для получения ввода с консоли используют класс Scanner. В качестве иллюстрации напишем программу, которая осуществляет ввод чисел:

import java.util.Scanner;

public class Program {

public static void main(String[] args) {
       
    Scanner in = new Scanner(System.in);
    System.out.print("Input a number: ");
    int num = in.nextInt();
      
    System.out.print("Your number: "+ num);
    in.close();
}
}
Так как класс Scanner находится в пакете java.util, то мы вначале его импортируем с помощью инструкции import java.util.Scanner.

Для создания самого объекта Scanner в его конструктор передается объект System.in. После этого мы можем получать вводимые значения. Например, в данном случае вначале выводим приглашение к вводу и затем получаем вводимое число в переменную num.

Чтобы получить введенное число, используется метод in.nextInt();, который возвращает введенное с клавиатуры целочисленное значение.

Написать программу, которая принимает с клавиатуры имя , фамилию и возраст (Ваши или воображаемого персонажа) и выводит в консоль эту информацию в следующем виде:

First name: John

Last name: Smith

Age: 25

code/inch/src/InchToMeter.java
import java.util.Scanner;

public class InchToMeter {
    public static void main(String[] args) {

    }
    // Написать программу, которая считывает с клавиатуры число в дюймах и конвертирует
    // его в метры. Один дюйм это 0,0254 метра
    // meter = inch * 0.0254
    // Вывести результат на экран
    Scanner scanner = new Scanner(System.in);
    
}
code/main/src/Main.java
import java.util.Scanner;

public class Main {
    public static void main(String[] args) {

     double divide = 25/3;
        System.out.println(divide);
        double x = 25;
        System.out.println(x/3);

        double y = 3;
        System.out.println(x/y);
        System.out.println(25.0%3);

        int a = 4;
        System.out.println(a*a*a);

        //Java Math Class
        //java.lang.Math

        //значение по модулю
        System.out.println(Math.abs(10)); //10
        System.out.println(Math.abs(-10.78));//10.78

        // мин число
        System.out.println(Math.min(10,20)); // 10

        // макс из двух чисел
        System.out.println(Math.max(10,20));

        //округление

        System.out.println(Math.round(24.345));
        System.out.println(Math.round(24.645));

        //случайное число

       double random = Math.random();
        System.out.println(random);
        System.out.println(random*100);

        // возведение в степень
        System.out.println(Math.pow(2,3));

        // извлечение корня
        System.out.println(Math.sqrt(4));

        // число пи
        System.out.println(Math.PI);

        // Scanner class - позволяет получить в программе ввод пользователя
        // java.util

        // создание сканера
        Scanner scanner = new Scanner(System.in);

        System.out.println("Enter first number");
        // чтение числа, введенного пользователем и сохранение его в переменной num1
        int num1 = scanner.nextInt();

        System.out.println("Enter second number");
        // чтение второго числа
        int num2 = scanner.nextInt();



        System.out.println("Sum of entered numbers is  "+(num1+num2));

      //  scanner.close();



        //метод для ввода строк

     //   Scanner scanner1 = new Scanner(System.in);

        System.out.println("Enter your name: ");
        scanner.nextLine();

        String name = scanner.next();

        System.out.println("Enter your surname: ");
        String surName = scanner.next();

        System.out.println("Hello, "+name+" "+surName);

      //  System.out.println(bin);
        System.out.println();

        scanner.close();

    }
}
code/temperature/src/Temperature.java
import java.util.Scanner;

public class Temperature {

    public static void main(String[] args) {
        //  написать программу , конвертирующую температуру по Фаренгейту в градусы
       // Цельсия. Формула для перевода Цельсий = 5*(Фаренгейт - 32)/9
        //Значение градусов фаренгейта ввести с клавиатуры.
        // Вывести результат на экран
        Scanner scanner = new Scanner(System.in);

        System.out.println("Enter temperature in Fahrenheit:");
        double farenheit = scanner.nextDouble();

        double celsius = 5*(farenheit - 32.0)/9.0;

        System.out.println(farenheit +" degree Fahrenheit is equal to "+celsius+" in Celsius");




    }


}