План на урок
Структура программы
Стиль кода
Переменные
Присваивание.
Названия переменных, snake_case и camelCase.
Типы данных, int и String.
Вывод данных в консоль. Комбинация чисел и строк в одной команде.

*******************************************************************************************************

Программа и её данные во время работы хранятся в памяти. Вся память компьютера представлена в виде маленьких ячеек — байт. У каждой ячейки есть её уникальный номер — 0,1,2,3,… (нумерация начинается с нуля). Зная номер ячейки, мы можем сохранить в неё какие-то данные. Или взять их из неё. В одних ячейках хранится код программы — набор команд для процессора, в других — данные этой программы. Номер каждой ячейки также называют её адресом.

Процессор – это такая штука, которая умеет исполнять команды из загруженной в память программы. Почти все команды процессора – это что-то типа «взять данные из некоторых ячеек, сделать с ними что-то, результат поместить в другие ячейки». Объединяя сотни простых команд, мы получаем сложные и полезные команды.

Когда в коде программы объявляется переменная, ей выделяется кусочек ещё не использованной памяти. Обычно это несколько байт. При объявлении переменной также нужно указать тип информации, которую программа будет хранить в ней: числа, текст, или другие данные. Для удобства каждой переменной задаётся уникальное имя.

В Java есть два основных типа: String и int. В String мы храним строки/текст, а в int – числа (целые). Чтобы объявить новую переменную, нужно написать её тип и имя. Это имя не должно быть именем другой переменной и/или функции.

String s;
int a;
Для того, чтобы занести новое значение в переменную, используется знак “=”. Его ещё называют «оператором присваивания». Присваивание – это занесение в переменную значения, взятого из другой переменной или вычисленного на основе нескольких переменных.

String s = “Kirill”;
int x = 42;
Строки можно объединять, используя знак плюс. Иногда удобно использовать строки, состоящие из одного или нескольких пробелов.

String route =  "Трасса";
int roadNumber = 60;
String text = "Мой любимый фильм - " + route + " " + roadNumber;
// text = "Мой любимый фильм - Трасса 60"
roadNumber = 66;
String text = "Мой любимый маршрут - " + route + " " + roadNumber;
// text2 = "Мой любимый маршрут - Трасса 66"
При сложении числа со строкой получится строка:

*******************************************************************************************************

Задача 1
Напишите программу, которая выводит на экран информацию о вас (или выдуманном персонаже) в три строчки:

"Меня зовут ..."
"Мне ... лет"
"Я из ..."
 На месте многоточий должны использоваться переменные!

Задача 2 *
Со звездочкой, не обязательная

Есть 2 целочисленные переменные a и b. Пусть a = 1, b =2. С помощью оператора присваивания и математических действий сложения и вычитания поменять значения a и b местами. т.е. должно быть в результате a =2, b=1. Просто присвоить a и b эти значения или вводить третью переменную нельзя. Задача должна быть решена для общего случая, т.е. для любых двух значений переменных, 1 и 2 просто пример. Если не получится с двумя переменными, можно попробовать более легкий вариант решения с введением третьей дополнительной переменной

***************************************************************************************************************

code/variables/src/Main.java
public class Main {

    // Переменные в Джава
    /*
    000 0
    001 1
    010 2
    011 3

    У каждой переменной в Джава есть три важных свойства: тип, имя  и значение.
    тип переменной определяет тип данных, которые в ней можно хранить

    Создание переменной
    тип имя
     */
    public static void main(String[] args) {


        int a;
        String b;

       // x = 56;
        int x = 456; // -2^31 до 2^31 -1    -2147483648 до 2147483647
        int y=23;
        x = 6;
        x = 5;
        x = 5;
        x = 12345;
        x = 2147483647;


        a = 25;
         x=245;
         int i = 2;
         x = i;
        System.out.println(x);

        x = i +3;//5

        x = x + 4;//9
        System.out.println(x);

        int number;
        number = 23;

        int next_number; //snake case
        int nextNumber; // camel case

        /*
        1. Названия перепменных в джава не могут содержать пробелы  , например num ber = 100
        2. Название переменной может начинаться со специального символа $  и _. Но не может начинаться
        с цифры
        2. Название должно начинаться с маленькой буквы
        3. Для  составных названий принят т.н. camel case: newNumber
         */
       int  _num;
       int $num;
      // int 6num;
       int num5;

       String name ="John";
       name = "Evgeny";
       name = "Kate";
        System.out.println("Kate");

        System.out.println("My name is "+name);

        String complex = "My name is" +" Evgeny";

        int num = 5+1;
        String strNum = "5";
        System.out.println(5+"5");
        System.out.println(num+strNum);

        System.out.println(2+4);
        System.out.println("2a"+"4");
        System.out.println("2"+4+5+4);
        System.out.println(2+3+"4");
        System.out.println("2"+(1+3));
        System.out.println("sum of 1 and 2 is "+(1+2));
        System.out.println(45 + 5 + "=" + 45 + 5);
        System.out.println(45 + 5 + "=" + (45 + 5));

        int num1,num2,num3;
        num1 = num2 = num3 = -100;

        num1 = num1 +10;
        num1 +=10;

        num2 = num2 -10;
        num2 -=10;









    }

}