Задачи на урок:

Разбор домашнего задания
Повторение пройденного - переменные, типы данных int и String
Целочисленные типы данных (byte,short,int,long)
Integer.MIN_VALUE и Integer.MAX_VALUE.
Тип данных double and float.
Арифметические операции (+, -, *, /, %).
Разница между обычным и целочисленным делением.
Остаток от деления.
Тип byte

Тип данных byte является 8-разрядным знаковым целым числом.

Минимальная величина равна -128 (-27).

Максимальное значение равно 127 (включительно) (27-1).

По умолчанию – 0.

byte предназначен для экономии места в больших массивах, главным образом вместо целых чисел, поскольку byte в четыре раза меньше, чем int. Пример: byte a = 100; byte b = -50;

Тип short

Тип данных short является 16-разрядным знаковым целым числом.

Минимальное значение равно -32768 (-215).

Максимальная величина равна 32 767 (включительно) (215-1).

Тип short в Java может также использоваться для экономии памяти как byte. Размер short в 2 раза меньше, чем int. По умолчанию – 0.

Пример: short s = 10000; short r = -20000;

Тип int

В языке Java тип данных int является 32-разрядным знаковым целым числом.

Минимальный размер int – 2 147 483 648 (-231).

Максимальная величина равна 2,147,483,647 (включительно)(231-1).

Тип int обычно используется для целых значений. Если нет озабоченности по поводу памяти. По умолчанию равно 0.

Пример: int a = 100000; int b =-200000;

Тип long

Тип данных long является 64-разрядным знаковым целым числом.

Минимальное значение равно – 9,223,372,036,854,775,808 (-263).

Максимальная величина – 9,223,372,036,854,775,807 (включительно). (263-1). В Java Применяется когда требуется более широкий диапазон, чем int.

По умолчанию – 0L.

Пример: long a = 100000L; long b =-200000L;

Тип float

Тип данных float является c одинарной точностью 32-битный IEEE 754 с плавающей точкой. Тип float используется главным образом для сохранения памяти в больших массивах чисел с плавающей точкой. По умолчанию – 0.0f. Тип float никогда не должен применяется для точного значения, например, валюты.

Пример: float f1 = 234.5f;

Тип double

Тип данных double является c двойной точностью 64-битный IEEE 754 с плавающей точкой. Обычно используется для десятичных значений. Тип double никогда не должен применяется для точного значения, например, валюты. По умолчанию – 0.0d. Пример: double d1 = 123.4;

Задача 1.
Написать программу, выводящую на экран результат деления двух чисел 25 и 3. Результат не должен быть округлен до целых. Посчитать также остаток от деления этих чисел.

Задача 2.
Написать программу, выводящую на экран значение переменной типа инт в квадрате. Предварительно обьявите эту переменную и задайте ее значение

code/varables1/src/Main.java
public class Main {
    public static void main(String[] args) {

        System.out.println("Hello world!");
        String name = "John";
        String city = "Berlin";
        int age = 35;

        System.out.println("My name is "+name);
        System.out.println("I live in "+city);
        System.out.println("I am "+age+" years old");

        /*
        Есть 2 целочисленные переменные a и b. Пусть a = 1, b =2.
        С помощью оператора присваивания и математических действий сложения
        и вычитания поменять значения a и b местами. т.е. должно быть в результате
        a =2, b=1. Просто присвоить a и b эти значения или вводить третью переменную
        нельзя. Задача должна быть решена для общего случая, т.е. для любых двух значений переменных, 1 и 2 просто пример.
        Если не получится с двумя переменными, можно попробовать
        более легкий вариант решения с введением третьей дополнительной переменной
         */

        int a = 20;
        int b = 134;

        //a = a +b - (b = a);

        a = a + b;
        b = a -b; // b = a
        a = a - b;//a= a+b -a

        System.out.println("a now is "+a+" , b now is "+b);

        int x = 10;
        int y = 5;
        int buffer = x;

        x = y;//x =5
        y = buffer;// y =10

        System.out.println("x = "+x);
        System.out.println("y = "+y);

        /*
        целочисленные типы данных
        1.byte - занимает 8 бит
        -128 до 127
         */
        byte num = 100;

        /*
        short - 16 бит ( 2 байта)
         */
        short s = 20456;

        // long - 64 бит ( 8 байт)
        long l = 1_235_675_678L;

        /*
        00
        01
        10
        11
         */

        // float - используются для хранения чисел с плавающей точкой
        float f = 3.147f;

        // double -  как и float  хранит числа с плавающей точкой, но с двойной точностью по сравнению c float

        double d = 34.5667788666666666666;

        //987654.321  0.987654321 * 10 power 6

        //Арифметические операторы
        /*
         + сложение
         - вычитание
         * - умножение
         / - деление
         % - остаток от деления
         ++ инкремент
         -- декремент

         */

        System.out.println(10/3);
        System.out.println(10%3);
        //3*3=9  отстаток от деления 1
        // 9 + 1 = 10

        double divide = 10.0/3;
        System.out.println(divide);

        int number =10;
       // number = number + 1;
        number++; // postfix
       // number--;
        ++number; // prefix

        int x1 = 10;
       // int y1 = ++x1; //11
       // y1 = x1+1;

        int y1 = x1++; //10
       // y1 = x1+1;
        System.out.println("y1 is "+y1);
        System.out.println("x1 is "+x1);


        // написать программу, которая выводит на экран площадь и периметр круга при заданном радиусе.
        // периметр = 2 * PI * radius
        // площадь = PI * radius * radius
        //

        double radius = 8.9;

        double perimeter = 2*3.14*radius;
        double area = 3.14*radius*radius;
        System.out.println(perimeter);
        System.out.println(area);



    }
}